/**
 * 系统常量
 */
export default {
	// http 状态码
  httpCode: {
    code_200: 200, // 成功
    code_201: 201, // 已创建
    code_202: 202, // 已接受
    code_203: 203, // 非授权信息
    code_204: 204, // 无内容
    code_205: 205, // 重置内容
    code_206: 206, // 部分内容
    code_300: 300, // 多种选择
    code_301: 301, // 永久移动
    code_302: 302, // 临时移动
    code_303: 303, // 查看其它位置
    code_304: 304, // 未修改
    code_305: 305, // 使用代理
    code_307: 307, // 临时重定向
    code_400: 400, // 错误请求
    code_401: 401, // 未授权
    code_403: 403, // 禁止
    code_404: 404, // 未找到
    code_405: 405, // 方法禁用
    code_406: 406, // 不接受
    code_407: 407, // 需要代理授权
    code_408: 408, // 请求超时
    code_409: 409, // 冲突
    code_410: 410, // 已删除
    code_411: 411, // 需要有效长度
    code_412: 412, // 未满足前提条件
    code_413: 413, // 请求实体过大
    code_414: 414, // 请求的URI过长
    code_415: 415, // 不支持的媒体类型
    code_416: 416, // 请求范围不符合要求
    code_417: 417, // 未满足期望值
    code_500: 500, // 服务器内部错误
    code_501: 501, // 尚未实施
    code_502: 502, // 错误网关
    code_503: 503, // 服务器不可用
    code_504: 504, // 网关超时
    code_505: 505 // HTTP 版本不受支持
  },

  apiConfig: {
    timeout: 60000,
    withCredentials: false,
    contentType: 'json',
    imgPath: "http://nzlhw.htqp.com.cn"
  },
  
}
